#Wizard game. Made by Aleksei Ivanov and Ilja Melikov
#Remake первоначального проекта в Scratch https://scratch.mit.edu/projects/1130069789/editor/

# Должна быть переменная, которая определяет какой уровень сейчас в игре. От неё зависит фон и появление NPC на экране

# В игре всегда играет музыка.

# Переменная Fireball. Должен быть небольшой таймаут между стрельбой. Fireball исчезает при столкновении с противником или заходе до конца экрана. Имеет звук.

# Переменная щита. Щит может бить противников, действует 3-5 секунд, перезарядка тоже около 5 секунд. Активность щита и перезарядка должны показываться на экране. Имеет звук.

# Диалоги. Кнопка E для прогресса по ветви диалога. Во время диалогов движение не доступно

# 0. Уровень - заствка с названием игры и нашими именами. "НАЖМИТЕ Е ЧТОБЫ НАЧАТЬ ИГРУ"

# 1. Уровень - лягуха рассказывает управление. Лягушка ждёт пока ты не выполнишь действия которая она требует.

# 2. Уровень - просто филлерный проход по атмосферной локации

# 3. Уровень - первый противник - зомби, двигается медленно, умирает от 1 файрболла.

# 4. Уровень - появление босса с его диалогом. !!Можно добавить варианты!!, во время диалога движение и удары заблокированы. После диалога босс перед боем включает свой щит на несколько секунд. Босс стреляет в тебя молниями с промежутком по времени.